{
    "adapter_layer_norm_eps": 1e-06,
    "alignment_activation_fn": "swiglu",
    "alignment_intermediate_size": 12288,
    "architectures": [
      "Cohere2VisionForConditionalGeneration"
    ],
    "downsample_factor": 2,
    "dtype": "bfloat16",
    "enable_adapter_layer_norm": false,
    "image_token": 255031,
    "image_token_id": 255031,
    "max_splits_per_img": 12,
    "model_type": "cohere2_vision",
    "quantization_config": {
      "config_groups": {
        "group_0": {
          "format": "float-quantized",
          "input_activations": {
            "actorder": null,
            "block_structure": null,
            "dynamic": true,
            "group_size": null,
            "num_bits": 8,
            "observer": null,
            "observer_kwargs": {},
            "scale_dtype": null,
            "strategy": "token",
            "symmetric": true,
            "type": "float",
            "zp_dtype": null
          },
          "output_activations": null,
          "targets": [
            "Linear"
          ],
          "weights": {
            "actorder": null,
            "block_structure": null,
            "dynamic": false,
            "group_size": null,
            "num_bits": 8,
            "observer": "memoryless_minmax",
            "observer_kwargs": {},
            "scale_dtype": null,
            "strategy": "channel",
            "symmetric": true,
            "type": "float",
            "zp_dtype": null
          }
        }
      },
      "format": "float-quantized",
      "global_compression_ratio": null,
      "ignore": [
        "model.vision_tower.vision_model.encoder.layers.0.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.0.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.0.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.0.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.0.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.0.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.1.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.1.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.1.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.1.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.1.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.1.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.2.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.2.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.2.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.2.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.2.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.2.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.3.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.3.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.3.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.3.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.3.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.3.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.4.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.4.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.4.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.4.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.4.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.4.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.5.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.5.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.5.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.5.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.5.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.5.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.6.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.6.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.6.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.6.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.6.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.6.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.7.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.7.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.7.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.7.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.7.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.7.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.8.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.8.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.8.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.8.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.8.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.8.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.9.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.9.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.9.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.9.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.9.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.9.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.10.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.10.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.10.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.10.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.10.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.10.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.11.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.11.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.11.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.11.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.11.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.11.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.12.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.12.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.12.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.12.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.12.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.12.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.13.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.13.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.13.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.13.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.13.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.13.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.14.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.14.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.14.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.14.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.14.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.14.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.15.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.15.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.15.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.15.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.15.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.15.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.16.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.16.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.16.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.16.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.16.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.16.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.17.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.17.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.17.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.17.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.17.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.17.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.18.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.18.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.18.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.18.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.18.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.18.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.19.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.19.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.19.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.19.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.19.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.19.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.20.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.20.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.20.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.20.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.20.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.20.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.21.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.21.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.21.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.21.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.21.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.21.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.22.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.22.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.22.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.22.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.22.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.22.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.23.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.23.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.23.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.23.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.23.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.23.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.24.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.24.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.24.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.24.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.24.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.24.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.25.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.25.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.25.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.25.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.25.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.25.mlp.fc2",
        "model.vision_tower.vision_model.encoder.layers.26.self_attn.k_proj",
        "model.vision_tower.vision_model.encoder.layers.26.self_attn.v_proj",
        "model.vision_tower.vision_model.encoder.layers.26.self_attn.q_proj",
        "model.vision_tower.vision_model.encoder.layers.26.self_attn.out_proj",
        "model.vision_tower.vision_model.encoder.layers.26.mlp.fc1",
        "model.vision_tower.vision_model.encoder.layers.26.mlp.fc2",
        "model.multi_modal_projector.linear_1",
        "model.multi_modal_projector.linear_2",
        "model.language_model.layers.0.self_attn.q_proj",
        "model.language_model.layers.0.self_attn.k_proj",
        "model.language_model.layers.0.self_attn.v_proj",
        "model.language_model.layers.0.self_attn.o_proj",
        "model.language_model.layers.0.mlp.gate",
        "model.language_model.layers.1.self_attn.q_proj",
        "model.language_model.layers.1.self_attn.k_proj",
        "model.language_model.layers.1.self_attn.v_proj",
        "model.language_model.layers.1.self_attn.o_proj",
        "model.language_model.layers.1.mlp.gate",
        "model.language_model.layers.2.self_attn.q_proj",
        "model.language_model.layers.2.self_attn.k_proj",
        "model.language_model.layers.2.self_attn.v_proj",
        "model.language_model.layers.2.self_attn.o_proj",
        "model.language_model.layers.2.mlp.gate",
        "model.language_model.layers.3.self_attn.q_proj",
        "model.language_model.layers.3.self_attn.k_proj",
        "model.language_model.layers.3.self_attn.v_proj",
        "model.language_model.layers.3.self_attn.o_proj",
        "model.language_model.layers.3.mlp.gate",
        "model.language_model.layers.4.self_attn.q_proj",
        "model.language_model.layers.4.self_attn.k_proj",
        "model.language_model.layers.4.self_attn.v_proj",
        "model.language_model.layers.4.self_attn.o_proj",
        "model.language_model.layers.4.mlp.gate",
        "model.language_model.layers.5.self_attn.q_proj",
        "model.language_model.layers.5.self_attn.k_proj",
        "model.language_model.layers.5.self_attn.v_proj",
        "model.language_model.layers.5.self_attn.o_proj",
        "model.language_model.layers.5.mlp.gate",
        "model.language_model.layers.6.self_attn.q_proj",
        "model.language_model.layers.6.self_attn.k_proj",
        "model.language_model.layers.6.self_attn.v_proj",
        "model.language_model.layers.6.self_attn.o_proj",
        "model.language_model.layers.6.mlp.gate",
        "model.language_model.layers.7.self_attn.q_proj",
        "model.language_model.layers.7.self_attn.k_proj",
        "model.language_model.layers.7.self_attn.v_proj",
        "model.language_model.layers.7.self_attn.o_proj",
        "model.language_model.layers.7.mlp.gate",
        "model.language_model.layers.8.self_attn.q_proj",
        "model.language_model.layers.8.self_attn.k_proj",
        "model.language_model.layers.8.self_attn.v_proj",
        "model.language_model.layers.8.self_attn.o_proj",
        "model.language_model.layers.8.mlp.gate",
        "model.language_model.layers.9.self_attn.q_proj",
        "model.language_model.layers.9.self_attn.k_proj",
        "model.language_model.layers.9.self_attn.v_proj",
        "model.language_model.layers.9.self_attn.o_proj",
        "model.language_model.layers.9.mlp.gate",
        "model.language_model.layers.10.self_attn.q_proj",
        "model.language_model.layers.10.self_attn.k_proj",
        "model.language_model.layers.10.self_attn.v_proj",
        "model.language_model.layers.10.self_attn.o_proj",
        "model.language_model.layers.10.mlp.gate",
        "model.language_model.layers.11.self_attn.q_proj",
        "model.language_model.layers.11.self_attn.k_proj",
        "model.language_model.layers.11.self_attn.v_proj",
        "model.language_model.layers.11.self_attn.o_proj",
        "model.language_model.layers.11.mlp.gate",
        "model.language_model.layers.12.self_attn.q_proj",
        "model.language_model.layers.12.self_attn.k_proj",
        "model.language_model.layers.12.self_attn.v_proj",
        "model.language_model.layers.12.self_attn.o_proj",
        "model.language_model.layers.12.mlp.gate",
        "model.language_model.layers.13.self_attn.q_proj",
        "model.language_model.layers.13.self_attn.k_proj",
        "model.language_model.layers.13.self_attn.v_proj",
        "model.language_model.layers.13.self_attn.o_proj",
        "model.language_model.layers.13.mlp.gate",
        "model.language_model.layers.14.self_attn.q_proj",
        "model.language_model.layers.14.self_attn.k_proj",
        "model.language_model.layers.14.self_attn.v_proj",
        "model.language_model.layers.14.self_attn.o_proj",
        "model.language_model.layers.14.mlp.gate",
        "model.language_model.layers.15.self_attn.q_proj",
        "model.language_model.layers.15.self_attn.k_proj",
        "model.language_model.layers.15.self_attn.v_proj",
        "model.language_model.layers.15.self_attn.o_proj",
        "model.language_model.layers.15.mlp.gate",
        "model.language_model.layers.16.self_attn.q_proj",
        "model.language_model.layers.16.self_attn.k_proj",
        "model.language_model.layers.16.self_attn.v_proj",
        "model.language_model.layers.16.self_attn.o_proj",
        "model.language_model.layers.16.mlp.gate",
        "model.language_model.layers.17.self_attn.q_proj",
        "model.language_model.layers.17.self_attn.k_proj",
        "model.language_model.layers.17.self_attn.v_proj",
        "model.language_model.layers.17.self_attn.o_proj",
        "model.language_model.layers.17.mlp.gate",
        "model.language_model.layers.18.self_attn.q_proj",
        "model.language_model.layers.18.self_attn.k_proj",
        "model.language_model.layers.18.self_attn.v_proj",
        "model.language_model.layers.18.self_attn.o_proj",
        "model.language_model.layers.18.mlp.gate",
        "model.language_model.layers.19.self_attn.q_proj",
        "model.language_model.layers.19.self_attn.k_proj",
        "model.language_model.layers.19.self_attn.v_proj",
        "model.language_model.layers.19.self_attn.o_proj",
        "model.language_model.layers.19.mlp.gate",
        "model.language_model.layers.20.self_attn.q_proj",
        "model.language_model.layers.20.self_attn.k_proj",
        "model.language_model.layers.20.self_attn.v_proj",
        "model.language_model.layers.20.self_attn.o_proj",
        "model.language_model.layers.20.mlp.gate",
        "model.language_model.layers.21.self_attn.q_proj",
        "model.language_model.layers.21.self_attn.k_proj",
        "model.language_model.layers.21.self_attn.v_proj",
        "model.language_model.layers.21.self_attn.o_proj",
        "model.language_model.layers.21.mlp.gate",
        "model.language_model.layers.22.self_attn.q_proj",
        "model.language_model.layers.22.self_attn.k_proj",
        "model.language_model.layers.22.self_attn.v_proj",
        "model.language_model.layers.22.self_attn.o_proj",
        "model.language_model.layers.22.mlp.gate",
        "model.language_model.layers.23.self_attn.q_proj",
        "model.language_model.layers.23.self_attn.k_proj",
        "model.language_model.layers.23.self_attn.v_proj",
        "model.language_model.layers.23.self_attn.o_proj",
        "model.language_model.layers.23.mlp.gate",
        "model.language_model.layers.24.self_attn.q_proj",
        "model.language_model.layers.24.self_attn.k_proj",
        "model.language_model.layers.24.self_attn.v_proj",
        "model.language_model.layers.24.self_attn.o_proj",
        "model.language_model.layers.24.mlp.gate",
        "model.language_model.layers.25.self_attn.q_proj",
        "model.language_model.layers.25.self_attn.k_proj",
        "model.language_model.layers.25.self_attn.v_proj",
        "model.language_model.layers.25.self_attn.o_proj",
        "model.language_model.layers.25.mlp.gate",
        "model.language_model.layers.26.self_attn.q_proj",
        "model.language_model.layers.26.self_attn.k_proj",
        "model.language_model.layers.26.self_attn.v_proj",
        "model.language_model.layers.26.self_attn.o_proj",
        "model.language_model.layers.26.mlp.gate",
        "model.language_model.layers.27.self_attn.q_proj",
        "model.language_model.layers.27.self_attn.k_proj",
        "model.language_model.layers.27.self_attn.v_proj",
        "model.language_model.layers.27.self_attn.o_proj",
        "model.language_model.layers.27.mlp.gate",
        "model.language_model.layers.28.self_attn.q_proj",
        "model.language_model.layers.28.self_attn.k_proj",
        "model.language_model.layers.28.self_attn.v_proj",
        "model.language_model.layers.28.self_attn.o_proj",
        "model.language_model.layers.28.mlp.gate",
        "model.language_model.layers.29.self_attn.q_proj",
        "model.language_model.layers.29.self_attn.k_proj",
        "model.language_model.layers.29.self_attn.v_proj",
        "model.language_model.layers.29.self_attn.o_proj",
        "model.language_model.layers.29.mlp.gate",
        "model.language_model.layers.30.self_attn.q_proj",
        "model.language_model.layers.30.self_attn.k_proj",
        "model.language_model.layers.30.self_attn.v_proj",
        "model.language_model.layers.30.self_attn.o_proj",
        "model.language_model.layers.30.mlp.gate",
        "model.language_model.layers.31.self_attn.q_proj",
        "model.language_model.layers.31.self_attn.k_proj",
        "model.language_model.layers.31.self_attn.v_proj",
        "model.language_model.layers.31.self_attn.o_proj",
        "model.language_model.layers.31.mlp.gate",
        "lm_head"
      ],
      "kv_cache_scheme": null,
      "quant_method": "compressed-tensors",
      "quantization_status": "compressed",
      "sparsity_config": {},
      "transform_config": {},
      "version": "0.15.1.dev6+g077e752"
    },
    "text_config": {
      "_sliding_window_pattern": 4,
      "architectures": [
        "Cohere2MoeForCausalLM"
      ],
      "attention_bias": false,
      "attention_dropout": 0.0,
      "bos_token_id": 2,
      "expert_selection_fn": "sigmoid",
      "first_k_dense_replace": 0,
      "head_dim": 128,
      "hidden_act": "silu",
      "hidden_size": 4096,
      "initializer_range": 0.02,
      "intermediate_size": 4096,
      "layer_norm_eps": 1e-05,
      "layer_switch": 4,
      "layer_types": [
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention",
        "sliding_attention",
        "sliding_attention",
        "sliding_attention",
        "full_attention"
      ],
      "logit_scale": 1.0,
      "max_position_embeddings": 200000,
      "model_type": "cohere2_moe",
      "norm_topk_prob": true,
      "num_attention_heads": 128,
      "num_experts": 128,
      "num_experts_per_tok": 8,
      "num_hidden_layers": 32,
      "num_key_value_heads": 8,
      "num_shared_experts": 4,
      "order_of_interleaved_layers": "local_attn_first",
      "position_embedding_type": "rope_gptj",
      "prefix_dense_intermediate_size": 16384,
      "prefix_dense_sliding_window_pattern": 1,
      "rms_norm_eps": null,
      "rope_scaling": null,
      "rope_theta": 50000,
      "rotary_pct": 1.0,
      "shared_expert_combination_strategy": "average",
      "sliding_window": 4096,
      "use_cache": true,
      "use_embedding_sharing": true,
      "use_gated_activation": true,
      "use_parallel_block": true,
      "use_parallel_embedding": false,
      "use_qk_norm": false,
      "vocab_size": 262144
    },
    "transformers_version": "4.56.2",
    "vision_config": {
      "attention_dropout": 0.0,
      "hidden_act": "gelu_pytorch_tanh",
      "hidden_size": 1152,
      "image_size": 512,
      "intermediate_size": 4304,
      "layer_norm_eps": 1e-06,
      "model_type": "siglip_vision_model",
      "num_attention_heads": 16,
      "num_channels": 3,
      "num_hidden_layers": 27,
      "patch_size": 16,
      "vision_use_head": false
    },
    "vision_feature_layer": -1,
    "vision_feature_select_strategy": "full"
  }
  